solution_type = {
    "additional": "Дополнительная",
    "classwork": "Классная",
    "homework": "Домашняя",
    "individual-work": "Самостоятельная",
    "control-work": "Контрольная",
    "": "-"
}
solution_result = {
    "auto-review": "🕑 На проверке",
    "rework": "❌ Доработать",
    "accepted": "✅ Принята",
    "review": "🕑 На проверке",
}
solution_verdict = {
    "runtime-error": "Ошибка при выполнении",
    "wrong-answer": "Неверный ответ",
    "compilation-error": "Ошибка компиляции или в оформлении",
    "presentation-error": "Неверный формат вывода",
    "ok": "",
    "": ""
}
solution_check_type = {
    True: "Ручная",
    False: "Автоматическая",
}