solution_type = {
    "additional": "Дополнительная",
    "classwork": "Классная",
    "homework": "Домашняя",
    "individual-work": "Самостоятельная",
    "control-work": "Контрольная",
    "": "-",
}
solution_result = {
    "auto-review": "🕑 На проверке",
    "rework": "❌ Доработать",
    "accepted": "✅ Принята",
    "review": "🕑 На проверке",
}
solution_verdict = {
    "runtime-error": "Ошибка при выполнении",
    "wrong-answer": "Неверный ответ",
    "compilation-error": "Ошибка компиляции или в оформлении",
    "presentation-error": "Неверный формат вывода",
    "ok": "",
    "": "",
}
solution_check_type = {
    True: "Ручная",
    False: "Автоматическая",
}
task_solution_type = {"1": "🟠", "2": "🟡", "3": "🔴", "4": "🟢", "5": "🤡", "6": "⚪"}

sections_types = {
    1: "ℹ ️ Классная работа  ℹ️",
    2: "ℹ️  Домашняя работа  ℹ️",
    3: "ℹ️  Дополнительные задачи  ℹ️",
    6: "ℹ️  Самостоятельная работа  ℹ️",
    7: "ℹ️  Контрольная работа  ℹ️",
}
lesson_types = {
    "normal": "Обычный",
    "test": "Тест",

}